{
  "destinations": [
    {
      "id": "1",
      "name": "Galle Fort",
      "category": "landmark",
      "description": "Historic 17th-century fort and UNESCO World Heritage site",
      "longDescription": "Galle Fort, a UNESCO World Heritage Site, is a magnificent example of Dutch colonial architecture built in 1588. This 130-acre fortress features well-preserved ramparts, bastions, and colonial buildings now housing boutique hotels, restaurants, museums, and shops. The iconic 1939 lighthouse offers stunning Indian Ocean views. Walking through the fort's narrow streets reveals a unique blend of European architecture and South Asian traditions, making it one of Sri Lanka's most captivating destinations for history enthusiasts and photographers alike.",
      "image": "https://images.unsplash.com/photo-1566073771259-6a8506099945?w=800",
      "latitude": 6.0261,
      "longitude": 80.2168,
      "rating": 4.8,
      "popular": true,
      "entryFee": "Free to enter fort area, museums charge separately",
      "openingHours": "24/7 for fort area, museums 9:00 AM - 5:00 PM",
      "bestTimeToVisit": "November to April (dry season), early morning or sunset for photography",
      "facilities": ["Parking", "Restaurants", "Hotels", "Souvenir Shops", "ATMs", "Public Restrooms"],
      "activities": ["Heritage Walk", "Photography", "Museum Visits", "Dining", "Shopping", "Sunset Watching"],
      "routes": ["2", "11"]
    },
    {
      "id": "2",
      "name": "Sigiriya Rock Fortress",
      "category": "landmark",
      "description": "Ancient rock fortress with stunning frescoes and views",
      "longDescription": "Sigiriya, or Lion Rock, is an ancient 5th-century rock fortress rising 200 meters above the plains. This UNESCO World Heritage Site features King Kashyapa's palace ruins atop the massive rock. The climb passes through elaborate gardens, water features, and famous frescoes of celestial maidens. Halfway up, the Lion's Gate with carved stone paws marks the final ascent. The summit offers breathtaking 360-degree views and palace ruins. The site showcases remarkable ancient urban planning with sophisticated water gardens and hydraulic technology.",
      "image": "https://images.unsplash.com/photo-1588668214407-6ea9a6d8c272?w=800",
      "latitude": 7.9570,
      "longitude": 80.7603,
      "rating": 4.9,
      "popular": true,
      "entryFee": "LKR 5,400 for foreigners, LKR 100 for locals",
      "openingHours": "7:00 AM - 5:30 PM (last entry at 5:00 PM)",
      "bestTimeToVisit": "Early morning (7-9 AM) to avoid heat and crowds, or late afternoon for sunset",
      "facilities": ["Parking", "Museum", "Restaurant", "Souvenir Shop", "Restrooms", "First Aid"],
      "activities": ["Rock Climbing", "Photography", "Historical Tour", "Fresco Viewing", "Garden Exploration"],
      "routes": ["14"]
    },
    {
      "id": "3",
      "name": "Temple of the Tooth",
      "category": "religious",
      "description": "Sacred Buddhist temple in Kandy housing the tooth relic",
      "longDescription": "Sri Dalada Maligawa houses Buddhism's sacred tooth relic in Kandy's royal palace complex. This UNESCO World Heritage Site features masterful Kandyan architecture with intricate wood carvings, ivory inlays, and beautiful Buddhist murals. The octagonal Paththirippuwa pavilion and golden-roofed shrine are stunning highlights. Daily ceremonies (puja) held thrice daily allow devotees to witness the sacred casket. The complex includes museums, libraries, and halls showcasing Sri Lanka's Buddhist heritage. The annual Esala Perahera festival in July/August is one of Asia's most spectacular celebrations.",
      "image": "https://images.unsplash.com/photo-1609137144813-7d9921338f24?w=800",
      "latitude": 7.2931,
      "longitude": 80.6411,
      "rating": 4.7,
      "popular": true,
      "entryFee": "LKR 2,000 for foreigners, LKR 500 for locals",
      "openingHours": "5:30 AM - 8:00 PM, Puja times: 5:30 AM, 9:30 AM, 6:30 PM",
      "bestTimeToVisit": "During Puja ceremonies for full experience, avoid major festival days if you prefer fewer crowds",
      "facilities": ["Shoe Storage", "Audio Guides", "Museum", "Restrooms", "Wheelchair Access"],
      "activities": ["Religious Ceremonies", "Museum Tour", "Photography (outside only)", "Cultural Learning"],
      "routes": ["1", "3", "8", "14"]
    },
    {
      "id": "4",
      "name": "Colombo National Museum",
      "category": "museum",
      "description": "Largest museum in Sri Lanka with rich cultural heritage",
      "longDescription": "The Colombo National Museum, established in 1877, is Sri Lanka's largest museum housing extensive collections spanning archaeology, anthropology, natural history, and art. The Indo-Saracenic architectural masterpiece features royal regalia, ancient manuscripts, traditional masks, and artifacts from Sri Lanka's colonial period. Highlights include the throne and crown jewels of Kandyan kings, prehistoric fossils, and rare palm-leaf manuscripts. The museum library contains over 100,000 books and ancient texts. Beautiful colonial-era architecture with spacious galleries makes exploring Sri Lanka's 2,500-year history a fascinating journey through time.",
      "image": "https://images.unsplash.com/photo-1580274455191-1c62238fa333?w=800",
      "latitude": 6.9271,
      "longitude": 79.8612,
      "rating": 4.5,
      "popular": false,
      "entryFee": "LKR 1,000 for foreigners, LKR 100 for locals",
      "openingHours": "9:00 AM - 5:00 PM (Closed on Fridays)",
      "bestTimeToVisit": "Weekday mornings for fewer crowds, avoid Friday closures",
      "facilities": ["Library", "Parking", "Gift Shop", "Restrooms", "Audio Guides"],
      "activities": ["Museum Tours", "Historical Learning", "Photography", "Research", "Cultural Education"],
      "routes": ["1", "2", "4", "6", "7", "9", "10", "12"]
    },
    {
      "id": "5",
      "name": "Yala National Park",
      "category": "nature",
      "description": "Wildlife safari destination famous for leopards",
      "longDescription": "Yala National Park, covering 979 square kilometers, boasts one of the world's highest leopard densities. This wildlife sanctuary offers incredible safaris through forests, grasslands, lagoons, and beaches. Home to 44 mammal species including elephants, sloth bears, deer, crocodiles, and over 215 bird species. Ancient rock temples and ruins add cultural significance. Early morning and late afternoon safaris provide the best wildlife viewing. The coastal area features pristine beaches and dramatic rock formations, creating a unique safari backdrop unlike any other African or Asian park.",
      "image": "https://images.unsplash.com/photo-1535083783855-76ae62b2914e?w=800",
      "latitude": 6.3667,
      "longitude": 81.5167,
      "rating": 4.8,
      "popular": true,
      "entryFee": "LKR 4,200 for foreigners, LKR 500 for locals (plus vehicle charges)",
      "openingHours": "6:00 AM - 6:00 PM, Safari times: 5:30 AM-9:00 AM & 2:30 PM-6:30 PM",
      "bestTimeToVisit": "February to July for best leopard sightings, December to May for migratory birds",
      "facilities": ["Safari Jeeps", "Guides", "Visitor Center", "Restrooms", "Camping Sites"],
      "activities": ["Wildlife Safari", "Bird Watching", "Photography", "Nature Walks", "Beach Visits"],
      "routes": []
    },
    {
      "id": "6",
      "name": "Nuwara Eliya",
      "category": "city",
      "description": "Hill country town known as Little England with tea plantations",
      "longDescription": "Nuwara Eliya, called 'Little England', is a charming hill station at 1,868 meters elevation featuring Tudor-style hotels, manicured gardens, and temperate climate. The surrounding hills showcase emerald tea plantations with working factories offering tours. Victoria Park, Lake Gregory for boating, and Hakgala Botanical Gardens are main attractions. One of Asia's finest golf courses, established in 1889, awaits enthusiasts. Cool temperatures around 10°C provide escape from tropical heat. Nearby attractions include Horton Plains National Park and stunning waterfalls, making it ideal for nature lovers.",
      "image": "https://images.unsplash.com/photo-1563241527-3004b7be0ffd?w=800",
      "latitude": 6.9497,
      "longitude": 80.7891,
      "rating": 4.6,
      "popular": true,
      "entryFee": "Town is free, attractions charge separately (Tea Factory: LKR 500, Gardens: LKR 200)",
      "openingHours": "Town accessible 24/7, attractions typically 8:00 AM - 5:00 PM",
      "bestTimeToVisit": "April for flowers, December-January for cool weather, avoid October monsoon",
      "facilities": ["Hotels", "Restaurants", "Golf Course", "Boat Rentals", "Shopping Centers"],
      "activities": ["Tea Factory Tours", "Boating", "Golfing", "Hiking", "Horse Riding", "Strawberry Picking"],
      "routes": ["8", "15"]
    },
    {
      "id": "7",
      "name": "Mirissa Beach",
      "category": "beach",
      "description": "Beautiful beach town perfect for whale watching",
      "longDescription": "Mirissa Beach is a pristine crescent of golden sand famous for whale and dolphin watching tours. This laid-back southern coast gem offers stunning sunsets, excellent surf conditions, and fresh seafood. The main attraction is whale watching expeditions from November to April, with high chances of spotting blue whales and dolphins. Coconut Tree Hill provides panoramic beach views perfect for photography. The calm turquoise waters are ideal for swimming and snorkeling. Beachfront restaurants serve delicious seafood while beach bars create a vibrant nightlife scene making Mirissa perfect for relaxation and adventure.",
      "image": "https://images.unsplash.com/photo-1559827260-dc66d52bef19?w=800",
      "latitude": 5.9449,
      "longitude": 80.4692,
      "rating": 4.7,
      "popular": true,
      "entryFee": "Free beach access, whale watching tours LKR 5,000-7,000",
      "openingHours": "Beach accessible 24/7, whale watching tours 6:00 AM - 12:00 PM",
      "bestTimeToVisit": "November to April for whale watching and calm seas",
      "facilities": ["Restaurants", "Hotels", "Surf Schools", "Dive Centers", "ATMs"],
      "activities": ["Whale Watching", "Swimming", "Surfing", "Snorkeling", "Sunset Viewing", "Beach Parties"],
      "routes": ["5", "11"]
    },
    {
      "id": "8",
      "name": "Ella",
      "category": "city",
      "description": "Scenic hill country town with hiking trails and waterfalls",
      "longDescription": "Ella, at 1,041 meters elevation, offers breathtaking views, lush hills, waterfalls, and scenic train journeys. The iconic Nine Arch Bridge showcases colonial railway engineering amidst tea plantations. Little Adam's Peak provides easy hiking with panoramic views, while Ella Rock offers challenging treks with spectacular vistas. Ravana Falls adds natural beauty. The laid-back atmosphere, cool climate, and stunning landscapes create perfect relaxation and adventure balance. The Ella to Kandy train ride is considered one of the world's most beautiful rail journeys, making this village a must-visit destination.",
      "image": "https://images.unsplash.com/photo-1551244072-5d12893278ab?w=800",
      "latitude": 6.8667,
      "longitude": 81.0467,
      "rating": 4.9,
      "popular": true,
      "entryFee": "Free to visit town, some viewpoints may charge minimal fees (LKR 50-200)",
      "openingHours": "Town accessible 24/7, best hiking times 6:00 AM - 10:00 AM",
      "bestTimeToVisit": "January to March for clear views, avoid October-November monsoons",
      "facilities": ["Guesthouses", "Restaurants", "Cafes", "Shops", "Travel Agencies"],
      "activities": ["Hiking", "Train Rides", "Waterfall Visits", "Tea Plantation Tours", "Zip-lining", "Rock Climbing"],
      "routes": ["3", "9", "13", "15"]
    },
    {
      "id": "9",
      "name": "Adam's Peak",
      "category": "adventure",
      "description": "Sacred mountain with challenging pilgrimage trail",
      "longDescription": "Adam's Peak (Sri Pada), standing 2,243 meters, holds religious significance for Buddhists, Hindus, Christians, and Muslims. The summit features a footprint-like rock formation attributed to various deities. Pilgrimage season (December-May) sees thousands making the nighttime ascent of 5,500 steps to witness spectacular sunrise. Rest stations provide refreshments along the steep climb. The summit experience is magical - sunrise casts a perfect triangular shadow on clouds below. Surrounding pristine rainforest hosts diverse wildlife, with beautiful Dalhousie village at the mountain's base serving as the starting point.",
      "image": "https://images.unsplash.com/photo-1506905925346-21bda4d32df4?w=800",
      "latitude": 6.8095,
      "longitude": 80.4989,
      "rating": 4.8,
      "popular": true,
      "entryFee": "Free (donations accepted at the summit temple)",
      "openingHours": "December to May: 24/7 access, Off-season: Limited access, start climb 2-3 AM for sunrise",
      "bestTimeToVisit": "December to May (pilgrimage season), weekdays less crowded than weekends",
      "facilities": ["Rest Stations", "Tea Stalls", "Restrooms", "Basic Medical Aid", "Guesthouses at Base"],
      "activities": ["Pilgrimage Climb", "Sunrise Viewing", "Photography", "Spiritual Experience", "Nature Observation"],
      "routes": []
    },
    {
      "id": "10",
      "name": "Arugam Bay",
      "category": "beach",
      "description": "World-class surfing destination on the east coast",
      "longDescription": "Arugam Bay is a world-renowned surfing destination with consistent waves from April to October, featuring one of the top ten surf spots globally. This laid-back beach town offers pristine beaches, excellent seafood, yoga retreats, and relaxed atmosphere. Nearby Kumana National Park provides safari opportunities for spotting elephants, crocodiles, and diverse birds. The lagoon offers calm waters for kayaking and paddleboarding. Rustic charm pervades beachfront restaurants, surf schools, and varied accommodation. Nearby attractions include Pottuvil Point, Whiskey Point, and ancient Muhudu Maha Viharaya temple.",
      "image": "https://images.unsplash.com/photo-1505142468610-359e7d316be0?w=800",
      "latitude": 6.8411,
      "longitude": 81.8361,
      "rating": 4.6,
      "popular": true,
      "entryFee": "Free beach access, surf board rentals LKR 1,000-2,000/day",
      "openingHours": "Beach accessible 24/7, best surf conditions 6:00 AM - 11:00 AM",
      "bestTimeToVisit": "April to October for surfing, November to March for calm waters",
      "facilities": ["Surf Schools", "Board Rentals", "Restaurants", "Guesthouses", "Yoga Studios", "Medical Center"],
      "activities": ["Surfing", "Swimming", "Yoga", "Safari Tours", "Kayaking", "Beach Relaxation", "Seafood Dining"],
      "routes": ["13"]
    },
    {
      "id": "11",
      "name": "Polonnaruwa",
      "category": "landmark",
      "description": "Ancient city with medieval ruins and royal palaces",
      "longDescription": "Polonnaruwa, a UNESCO World Heritage Site, was Sri Lanka's medieval capital from 11th-13th centuries. This archaeological wonder features remarkably preserved ruins including the Royal Palace complex, Gal Vihara's magnificent rock-carved Buddha statues, and the circular Vatadage shrine. The ancient city showcases advanced irrigation systems with massive reservoirs like Parakrama Samudra. Highlights include the Audience Hall with elephant carvings, Lotus Pond, and Lankatilaka temple. Exploring by bicycle reveals stunning architecture spanning Hindu and Buddhist influences, making it essential for history enthusiasts visiting Sri Lanka's Cultural Triangle.",
      "image": "https://images.unsplash.com/photo-1548013146-72479768bada?w=800",
      "latitude": 7.9403,
      "longitude": 81.0188,
      "rating": 4.7,
      "popular": true,
      "entryFee": "LKR 3,900 for foreigners, LKR 100 for locals",
      "openingHours": "7:00 AM - 6:00 PM daily",
      "bestTimeToVisit": "Early morning or late afternoon to avoid heat, December to March for dry weather",
      "facilities": ["Museum", "Parking", "Bicycle Rentals", "Restrooms", "Guide Services", "Cafeteria"],
      "activities": ["Cycling Tours", "Archaeological Exploration", "Photography", "Historical Tours", "Temple Visits"],
      "routes": ["16"]
    },
    {
      "id": "12",
      "name": "Ruwanwelisaya Stupa",
      "category": "religious",
      "description": "Ancient Buddhist stupa in Anuradhapura",
      "longDescription": "Ruwanwelisaya is a magnificent white stupa built in 140 BC by King Dutugemunu in Anuradhapura, standing 103 meters tall. This sacred Buddhist monument is adorned with hundreds of elephant sculptures around its base, creating a striking architectural feature. The gleaming white dome contains holy relics and represents one of Sri Lanka's most revered pilgrimage sites. The surrounding complex includes beautifully maintained gardens, smaller stupas, and meditation areas. Evening visits offer magical views when the stupa is illuminated. As part of the ancient Anuradhapura UNESCO site, it showcases exceptional ancient engineering and religious devotion.",
      "image": "https://images.unsplash.com/photo-1552465011-b4e21bf6e79a?w=800",
      "latitude": 8.3489,
      "longitude": 80.3961,
      "rating": 4.6,
      "popular": true,
      "entryFee": "Free, donations welcome",
      "openingHours": "6:00 AM - 8:00 PM daily",
      "bestTimeToVisit": "Early morning or evening for cooler weather and beautiful lighting",
      "facilities": ["Parking", "Restrooms", "Shoe Storage", "Information Center", "Prayer Halls"],
      "activities": ["Religious Ceremonies", "Meditation", "Photography", "Cultural Learning", "Pilgrimage"],
      "routes": ["6"]
    },
    {
      "id": "13",
      "name": "Unawatuna Beach",
      "category": "beach",
      "description": "Crescent-shaped beach with coral reefs",
      "longDescription": "Unawatuna features a beautiful crescent-shaped bay with golden sand and turquoise waters protected by coral reef. The reef creates calm waters ideal for swimming and snorkeling with colorful tropical fish. Palm-lined beaches feature restaurants serving fresh seafood and cocktails. Nearby Jungle Beach offers secluded experiences via short jungle trek. The Japanese Peace Pagoda on Rumassala Hill provides panoramic views and peaceful atmosphere. Water sports including diving, paddleboarding, and kayaking are available. Vibrant nightlife with beach parties and live music enlivens peak season evenings.",
      "image": "https://images.unsplash.com/photo-1507525428034-b723cf961d3e?w=800",
      "latitude": 6.0105,
      "longitude": 80.2497,
      "rating": 4.5,
      "popular": true,
      "entryFee": "Free beach access, snorkeling equipment rental LKR 500-1,000",
      "openingHours": "Beach accessible 24/7, water sports 8:00 AM - 5:00 PM",
      "bestTimeToVisit": "November to April for calm seas, December to March peak season",
      "facilities": ["Restaurants", "Hotels", "Dive Centers", "Equipment Rentals", "ATMs", "Pharmacies"],
      "activities": ["Swimming", "Snorkeling", "Diving", "Surfing", "Beach Sports", "Sunset Watching", "Nightlife"],
      "routes": ["2", "11"]
    },
    {
      "id": "14",
      "name": "Horton Plains",
      "category": "nature",
      "description": "Stunning plateau with World's End viewpoint",
      "longDescription": "Horton Plains National Park is a UNESCO World Heritage Site at 2,100-2,300 meters elevation, featuring montane grasslands and cloud forests. World's End, a sheer 880-meter cliff, offers spectacular views across southern plains on clear mornings. Baker's Falls cascades 20 meters through pristine forest. The 9.5-kilometer circular trail traverses wetlands, forests, and grasslands. Endemic wildlife includes sambar deer, leopards, and numerous bird species. The misty plains create an otherworldly atmosphere, especially at dawn. Cool climate and high altitude provide refreshing contrast to tropical lowlands.",
      "image": "https://images.unsplash.com/photo-1549366021-9f761d450615?w=800",
      "latitude": 6.8106,
      "longitude": 80.7978,
      "rating": 4.9,
      "popular": true,
      "entryFee": "LKR 3,000 for foreigners, LKR 300 for locals (plus vehicle charges)",
      "openingHours": "6:00 AM - 6:00 PM, enter before 10:00 AM to avoid mist at World's End",
      "bestTimeToVisit": "January to March for clear views, arrive by 7:00 AM before clouds obscure views",
      "facilities": ["Visitor Center", "Parking", "Restrooms", "Picnic Areas", "Information Boards"],
      "activities": ["Hiking", "Wildlife Watching", "Bird Watching", "Photography", "Nature Study"],
      "routes": ["15"]
    },
    {
      "id": "15",
      "name": "Colombo City",
      "category": "city",
      "description": "Vibrant capital with shopping and nightlife",
      "longDescription": "Colombo, Sri Lanka's commercial capital, blends colonial-era buildings with modern skyscrapers in a vibrant metropolis. The historic Fort area showcases colonial architecture while Pettah Market offers authentic local shopping. Galle Face Green oceanfront park comes alive evenings with food vendors and kite flyers. The National Museum houses cultural artifacts and royal regalia. Modern Colombo features upscale malls, fine dining, rooftop bars, and art galleries. Religious diversity shines through Gangaramaya Temple, Jami Ul-Alfar Mosque, and St. Anthony's Church. The dining scene ranges from street food to world-class restaurants.",
      "image": "https://images.unsplash.com/photo-1512453979798-5ea266f8880c?w=800",
      "latitude": 6.9271,
      "longitude": 79.8612,
      "rating": 4.3,
      "popular": true,
      "entryFee": "City entry free, museums typically LKR 1,000-2,000 for foreigners",
      "openingHours": "City accessible 24/7, attractions typically 9:00 AM - 5:00 PM",
      "bestTimeToVisit": "January to March for dry weather, avoid May and October monsoons",
      "facilities": ["Shopping Malls", "Restaurants", "Hotels", "Public Transport", "Hospitals", "ATMs"],
      "activities": ["Shopping", "Dining", "Museum Visits", "Temple Tours", "Nightlife", "Beach Walks", "Street Food Tours"],
      "routes": ["1", "2", "4", "6", "7", "9", "10", "12"]
    },
    {
      "id": "16",
      "name": "Kitulgala",
      "category": "adventure",
      "description": "White water rafting and adventure sports hub",
      "longDescription": "Kitulgala is Sri Lanka's adventure capital, famous for white-water rafting on the Kelani River with Grade 2-3 rapids perfect for beginners and experienced rafters. This rainforest village gained fame as a filming location for 'The Bridge on the River Kwai.' Beyond rafting, activities include canyoning, waterfall abseiling, jungle trekking, and bird watching in pristine rainforest. The area receives high rainfall making it lush year-round with cascading waterfalls and diverse wildlife. Adventure operators provide all equipment and trained guides ensuring safe thrilling experiences in one of Sri Lanka's most beautiful natural settings.",
      "image": "https://images.unsplash.com/photo-1544551763-46a013bb70d5?w=800",
      "latitude": 6.9894,
      "longitude": 80.4178,
      "rating": 4.5,
      "popular": true,
      "entryFee": "Village free, rafting tours LKR 3,000-4,500",
      "openingHours": "Adventure activities 8:00 AM - 4:00 PM daily",
      "bestTimeToVisit": "May to December for best water levels, year-round for other activities",
      "facilities": ["Adventure Centers", "Equipment Rentals", "Guides", "Restaurants", "Guesthouses", "First Aid"],
      "activities": ["White Water Rafting", "Canyoning", "Abseiling", "Jungle Trekking", "Bird Watching", "Swimming"],
      "routes": ["17"]
    },
    {
      "id": "17",
      "name": "Maritime Museum Galle",
      "category": "museum",
      "description": "Museum showcasing Sri Lanka's maritime history",
      "longDescription": "The National Maritime Museum in Galle Fort occupies a historic Dutch warehouse dating to the 17th century. Collections showcase Sri Lanka's rich maritime heritage including ancient navigation instruments, ship models, marine archaeology finds, and exhibits on traditional fishing methods. Displays cover the Portuguese, Dutch, and British colonial periods highlighting Galle's importance as a major port. Marine life exhibits feature specimens of fish, corals, and shells from Sri Lankan waters. The museum provides fascinating insight into the island's seafaring traditions and role in Indian Ocean trade routes spanning centuries.",
      "image": "https://images.unsplash.com/photo-1565374326986-ce9ba7c2a5e5?w=800",
      "latitude": 6.0271,
      "longitude": 80.2170,
      "rating": 4.2,
      "popular": false,
      "entryFee": "LKR 500 for foreigners, LKR 50 for locals",
      "openingHours": "9:00 AM - 5:00 PM (Closed Mondays and public holidays)",
      "bestTimeToVisit": "Morning hours combined with Galle Fort exploration",
      "facilities": ["Parking", "Gift Shop", "Restrooms", "Information Desk"],
      "activities": ["Museum Tours", "Historical Learning", "Photography", "Maritime Education"],
      "routes": ["2", "11"]
    },
    {
      "id": "18",
      "name": "Dambulla Cave Temple",
      "category": "religious",
      "description": "Cave temple complex with ancient Buddhist paintings",
      "longDescription": "Dambulla Cave Temple, a UNESCO World Heritage Site dating to 1st century BCE, is Sri Lanka's largest cave temple complex. Five caves carved into a 160-meter rock contain over 150 Buddha statues and 2,100 square meters of ancient murals. Cave 2 houses 53 Buddha statues and elaborate frescoes depicting Buddha's life and Sinhalese history spanning 22 centuries. The steep but manageable climb offers panoramic countryside views. A 30-meter golden Buddha statue at the base is visible for miles, marking this sacred pilgrimage site.",
      "image": "https://images.unsplash.com/photo-1570366583862-f91883984fde?w=800",
      "latitude": 7.8606,
      "longitude": 80.6489,
      "rating": 4.7,
      "popular": true,
      "entryFee": "LKR 2,000 for foreigners, LKR 500 for locals",
      "openingHours": "7:30 AM - 12:30 PM, afternoons sometimes open depending on ceremonies",
      "bestTimeToVisit": "Early morning to avoid heat and crowds, especially during cultural triangle tours",
      "facilities": ["Museum", "Parking", "Restrooms", "Souvenir Shop", "Guide Services"],
      "activities": ["Cave Exploration", "Religious Ceremonies", "Photography", "Historical Learning", "Art Appreciation"],
      "routes": ["14"]
    },
    {
      "id": "19",
      "name": "Bundala National Park",
      "category": "nature",
      "description": "Wetland paradise for bird watching",
      "longDescription": "Bundala National Park is a Ramsar Wetland of International Importance famous for hosting thousands of migratory birds, particularly flamingos from September to March. This coastal park features lagoons, sand dunes, and scrubland hosting over 200 bird species making it a paradise for birdwatchers and photographers. The park is also home to elephants, crocodiles, wild boar, deer, and four species of marine turtles nesting on beaches. Winter months bring spectacular gatherings of greater flamingos creating pink-hued flocks. The diverse ecosystems and accessible tracks make wildlife viewing exceptional throughout the year.",
      "image": "https://images.unsplash.com/photo-1501594907352-04cda38ebc29?w=800",
      "latitude": 6.1833,
      "longitude": 81.2000,
      "rating": 4.4,
      "popular": true,
      "entryFee": "LKR 3,000 for foreigners, LKR 300 for locals (plus vehicle charges)",
      "openingHours": "6:00 AM - 6:00 PM, Safari times: 6:00 AM-10:00 AM & 3:00 PM-6:00 PM",
      "bestTimeToVisit": "September to March for migratory birds, early morning for best wildlife viewing",
      "facilities": ["Safari Jeeps", "Guides", "Visitor Center", "Restrooms", "Observation Points"],
      "activities": ["Bird Watching", "Wildlife Safari", "Photography", "Nature Study", "Flamingo Watching"],
      "routes": ["18"]
    },
    {
      "id": "20",
      "name": "Jaffna Fort",
      "category": "landmark",
      "description": "Historic Dutch fort in northern Sri Lanka",
      "longDescription": "Jaffna Fort is one of Sri Lanka's largest fortifications, built by the Portuguese in 1618 and extensively modified by the Dutch in 1658. This star-shaped fort features massive ramparts, bastions, and a moat, showcasing colonial military architecture. After years of civil war damage, extensive restoration has revived the fort revealing barracks, churches, and administrative buildings. The fort offers panoramic views of Jaffna city and lagoon from the ramparts. Walking through the massive gates and exploring the vast interior provides glimpses into northern Sri Lanka's complex colonial and recent history.",
      "image": "https://images.unsplash.com/photo-1555400038-63f5ba517a47?w=800",
      "latitude": 9.6615,
      "longitude": 80.0255,
      "rating": 4.3,
      "popular": true,
      "entryFee": "Free entry",
      "openingHours": "8:00 AM - 6:00 PM daily",
      "bestTimeToVisit": "Early morning or late afternoon for cooler weather and good photography light",
      "facilities": ["Parking", "Information Boards", "Viewing Points", "Restrooms"],
      "activities": ["Historical Tours", "Photography", "Architecture Appreciation", "City Views", "Cultural Learning"],
      "routes": ["7"]
    },
    
    {
      "id": "21",
      "name": "Bentota Beach",
      "category": "beach",
      "description": "Popular beach resort with water sports",
      "longDescription": "Bentota offers perfect blend of sun, sand, and water sports along southwestern coast. Golden sand beach backed by coconut palms features luxury resorts. The Bentota River creates unique estuarine environment ideal for water sports. River safaris reveal mangrove forests with monitor lizards, crocodiles, and bird species. Calm waters perfect for jet-skiing, banana boats, and windsurfing. Brief Garden showcases stunning landscapes and art collection. The Turtle Hatchery provides conservation education. Protected bay creates calm seas for swimming, diving, snorkeling, and deep-sea fishing adventures.",
      "image": "https://images.unsplash.com/photo-1519046904884-53103b34b206?w=800",
      "latitude": 6.4258,
      "longitude": 79.9953,
      "rating": 4.6,
      "popular": true,
      "entryFee": "Free beach access, water sports prices vary (Jet-ski: LKR 3,000-5,000)",
      "openingHours": "Beach accessible 24/7, water sports operators 8:00 AM - 6:00 PM",
      "bestTimeToVisit": "November to April for best weather, calm seas and water sports",
      "facilities": ["Luxury Resorts", "Restaurants", "Water Sports Centers", "Spas", "Dive Shops"],
      "activities": ["Swimming", "Jet-skiing", "Windsurfing", "River Safaris", "Diving", "Turtle Watching", "Spa Treatments"],
      "routes": ["10"]
    },
    {
      "id": "22",
      "name": "Kandy City",
      "category": "city",
      "description": "Cultural capital surrounded by hills and tea estates",
      "longDescription": "Kandy, Sri Lanka's last royal capital (1592-1815), is a UNESCO World Heritage Site nestled among misty hills. Picturesque Kandy Lake, created in 1807, marks the city's heart. Beyond the Temple of the Tooth, attractions include Royal Palace complex, National Museum, and Garrison Cemetery. Peradeniya Botanical Gardens house over 4,000 plant species across 147 acres. Surrounded by tea plantations with cooler temperatures, Kandy serves as excellent base for exploring tea factories, Udawattakele Forest Reserve, and viewpoints. The city remains a cultural center for traditional Kandyan dance, drumming, and crafts.",
      "image": "https://images.unsplash.com/photo-1544735716-392fe2489ffa?w=800",
      "latitude": 7.2906,
      "longitude": 80.6337,
      "rating": 4.7,
      "popular": true,
      "entryFee": "City free, attractions charge separately (Botanical Gardens: LKR 1,500)",
      "openingHours": "City accessible 24/7, attractions typically 8:00 AM - 6:00 PM",
      "bestTimeToVisit": "January-April or July-August for Esala Perahera festival",
      "facilities": ["Hotels", "Restaurants", "Shopping Centers", "Cultural Centers", "Medical Facilities"],
      "activities": ["Temple Visits", "Cultural Shows", "Botanical Gardens", "Lake Walks", "Shopping", "Tea Factory Tours"],
      "routes": ["1", "3", "8", "14"]
    },
    {
      "id": "23",
      "name": "Tea Museum Kandy",
      "category": "museum",
      "description": "Museum dedicated to Ceylon tea heritage",
      "longDescription": "The Ceylon Tea Museum occupies a four-story colonial tea factory established in 1925, located 4km south of Kandy. Exhibits showcase the complete history of Ceylon tea from its introduction by British planters to becoming world-famous. Displays include vintage tea processing machinery, photographs, historical documents, and a library dedicated to tea. The top floor features a tea center where visitors can sample different Ceylon teas while enjoying panoramic views of tea estates. The museum provides fascinating insight into tea production methods and the industry's crucial role in Sri Lanka's economy and culture.",
      "image": "https://images.unsplash.com/photo-1565374326986-ce9ba7c2a5e5?w=800",
      "latitude": 7.2456,
      "longitude": 80.5936,
      "rating": 4.4,
      "popular": true,
      "entryFee": "LKR 700 for foreigners, LKR 100 for locals",
      "openingHours": "8:30 AM - 4:00 PM (Closed Mondays and public holidays)",
      "bestTimeToVisit": "Morning hours combined with Kandy sightseeing",
      "facilities": ["Tea Tasting Room", "Library", "Gift Shop", "Parking", "Restrooms", "Viewing Deck"],
      "activities": ["Tea Tasting", "Museum Tours", "Historical Learning", "Photography", "Tea Shopping"],
      "routes": ["1", "3", "8", "14"]
    },
    {
      "id": "24",
      "name": "Mihintale",
      "category": "religious",
      "description": "Sacred Buddhist pilgrimage site with ancient stupas",
      "longDescription": "Mihintale is Buddhism's birthplace in Sri Lanka, where Arahat Mahinda converted King Devanampiyatissa to Buddhism in 247 BC. This sacred mountain requires climbing 1,840 granite steps past ancient stupas, meditation caves, and monastery ruins. The summit offers spectacular panoramic views across the plains. Key sites include the Ambasthala Dagoba marking the meeting spot, the massive Mahaseya Stupa, ancient hospital ruins with stone medicine troughs, and the Aradhana Gala meditation rock with breathtaking views. The full moon Poson festival in June celebrates Buddhism's introduction with massive pilgrimages and illuminations.",
      "image": "https://images.unsplash.com/photo-1580537659466-0a9bfa916a54?w=800",
      "latitude": 8.3506,
      "longitude": 80.5069,
      "rating": 4.5,
      "popular": true,
      "entryFee": "LKR 500 for foreigners, free for locals",
      "openingHours": "6:00 AM - 6:00 PM daily",
      "bestTimeToVisit": "Early morning to avoid heat when climbing, June for Poson festival",
      "facilities": ["Rest Stops", "Drinking Water", "Restrooms", "Information Center", "Shoe Storage"],
      "activities": ["Pilgrimage Climb", "Religious Ceremonies", "Photography", "Historical Tours", "Meditation"],
      "routes": ["6"]
    },
    {
      "id": "25",
      "name": "Mulkirigala Rock Temple",
      "category": "religious",
      "description": "Ancient rock temple with cave paintings and inscriptions",
      "longDescription": "Mulkirigala is a spectacular rock temple rising 205 meters, featuring seven levels connected by steep staircases carved into the rock. Dating back to the 3rd century BC, this temple complex contains ancient cave temples with well-preserved murals and over 200 Buddha statues. The climb through five terraces passes shrines, resting spots, and stone inscriptions. The summit offers panoramic views of the southern plains and nearby villages. Less crowded than famous sites, Mulkirigala provides an authentic spiritual experience with resident monks and active worship. The site gained historical importance when Dutch scholar discovered ancient palm-leaf manuscripts here.",
      "image": "https://images.unsplash.com/photo-1604328698692-f76ea9498e76?w=800",
      "latitude": 6.1247,
      "longitude": 80.7372,
      "rating": 4.3,
      "popular": false,
      "entryFee": "LKR 500 for foreigners, free for locals",
      "openingHours": "6:00 AM - 6:00 PM daily",
      "bestTimeToVisit": "Early morning or late afternoon to avoid midday heat during the climb",
      "facilities": ["Parking", "Restrooms", "Shoe Storage", "Drinking Water", "Donation Box"],
      "activities": ["Temple Visits", "Rock Climbing", "Meditation", "Photography", "Cultural Learning"],
      "routes": []
    },
    {
      "id": "26",
      "name": "Sinharaja Forest Reserve",
      "category": "nature",
      "description": "UNESCO rainforest with endemic species",
      "longDescription": "Sinharaja, Sri Lanka's last viable rainforest, is a UNESCO World Heritage Site covering 11,187 hectares of pristine biodiversity. This tropical lowland rainforest hosts an incredible concentration of endemic species - over 50% of Sri Lanka's endemic trees, butterflies, birds, and amphibians. Expert guides lead treks through dense jungle revealing purple-faced langurs, endemic birds like Sri Lanka blue magpie, and countless insects and reptiles. The forest receives heavy rainfall creating lush vegetation, cascading streams, and natural pools. Challenging trails reward with extraordinary wildlife encounters and the immersive experience of one of Asia's most important rainforests.",
      "image": "https://images.unsplash.com/photo-1511497584788-876760111969?w=800",
      "latitude": 6.4008,
      "longitude": 80.4047,
      "rating": 4.6,
      "popular": false,
      "entryFee": "LKR 3,000 for foreigners, LKR 300 for locals (guide mandatory, additional cost)",
      "openingHours": "6:00 AM - 5:00 PM, best to enter by 8:00 AM",
      "bestTimeToVisit": "December to March for less rain, though wet season offers better wildlife viewing",
      "facilities": ["Visitor Centers", "Basic Accommodation", "Guides", "Parking", "Restrooms", "Trails"],
      "activities": ["Jungle Trekking", "Bird Watching", "Wildlife Photography", "Nature Study", "Research"],
      "routes": []
    },
    {
      "id": "27",
      "name": "Mannar Island",
      "category": "landmark",
      "description": "Historic island with baobab trees and ancient ruins",
      "longDescription": "Mannar Island connects to mainland via causeway, offering unique blend of history, culture, and nature. Ancient baobab trees dot the landscape, remnants of ancient trade with Africa. The ruins of Mannar Fort built by Portuguese and later occupied by Dutch showcase colonial architecture. Adam's Bridge (Rama Setu) chain of limestone shoals connects India, visible from Talaimannar. The island's diverse population includes Tamil, Muslim, and Sinhalese communities creating rich cultural tapestry. Pristine beaches, salt pans, and the nearby Gulf of Mannar Marine National Park with dugongs and dolphins offer natural beauty away from tourist crowds.",
      "image": "https://images.unsplash.com/photo-1559827260-dc66d52bef19?w=800",
      "latitude": 8.9810,
      "longitude": 79.9044,
      "rating": 4.1,
      "popular": false,
      "entryFee": "Island access free, fort and specific sites may charge nominal fees",
      "openingHours": "Accessible 24/7, fort typically 8:00 AM - 5:00 PM",
      "bestTimeToVisit": "December to March for pleasant weather, avoid monsoon season",
      "facilities": ["Guesthouses", "Restaurants", "Petrol Stations", "Basic Shops", "ATMs"],
      "activities": ["Historical Exploration", "Beach Visits", "Bird Watching", "Cultural Tours", "Photography"],
      "routes": []
    },
    {
      "id": "28",
      "name": "Udawalawe National Park",
      "category": "nature",
      "description": "Elephant sanctuary and wildlife reserve",
      "longDescription": "Udawalawe National Park is renowned for having one of the largest wild elephant populations in Sri Lanka with herds often numbering 50-60 individuals. Established around Udawalawe Reservoir, the park's grasslands and scrub jungle create excellent wildlife viewing conditions. Besides elephants, visitors spot water buffalo, crocodiles, sambar deer, wild boar, and over 200 bird species including rare Sri Lankan endemics. The adjacent Elephant Transit Home rehabilitates orphaned elephant calves. Open terrain allows exceptional photography opportunities. Safaris run throughout the day with consistent wildlife sightings making it ideal for families and guaranteed elephant encounters.",
      "image": "https://images.unsplash.com/photo-1564760055775-d63b17a55c44?w=800",
      "latitude": 6.4827,
      "longitude": 80.8986,
      "rating": 4.7,
      "popular": false,
      "entryFee": "LKR 3,900 for foreigners, LKR 500 for locals (plus vehicle charges)",
      "openingHours": "6:00 AM - 6:00 PM, Safari times: 6:00 AM-10:00 AM & 2:00 PM-6:00 PM",
      "bestTimeToVisit": "May to September for best elephant sightings when herds gather near water",
      "facilities": ["Safari Jeeps", "Guides", "Visitor Center", "Elephant Transit Home", "Restrooms", "Parking"],
      "activities": ["Wildlife Safari", "Elephant Watching", "Bird Watching", "Photography", "Nature Study"],
      "routes": []
    },
    {
      "id": "29",
      "name": "Trincomalee Beaches",
      "category": "beach",
      "description": "Pristine eastern beaches with historic sites",
      "longDescription": "Trincomalee boasts some of Asia's finest natural harbors and pristine beaches along the eastern coast. Nilaveli and Uppuveli beaches feature powdery white sand, crystal-clear turquoise waters, and excellent snorkeling among coral reefs. Pigeon Island National Park, just offshore, offers world-class snorkeling and diving with reef sharks, sea turtles, and vibrant coral gardens. Hot springs at Kanniya provide unique thermal bathing experiences. Fort Frederick and Koneswaram Temple perch on Swami Rock offering stunning ocean views. The area's relative remoteness ensures uncrowded beaches and authentic experiences with Tamil and Muslim cultural influences.",
      "image": "https://images.unsplash.com/photo-1507525428034-b723cf961d3e?w=800",
      "latitude": 8.5874,
      "longitude": 81.2152,
      "rating": 4.5,
      "popular": false,
      "entryFee": "Beach access free, Pigeon Island: LKR 3,000 for foreigners, LKR 300 locals",
      "openingHours": "Beaches accessible 24/7, boat trips to Pigeon Island 9:00 AM - 3:00 PM",
      "bestTimeToVisit": "April to October for calm seas and excellent snorkeling conditions",
      "facilities": ["Hotels", "Restaurants", "Dive Centers", "Boat Services", "Beach Equipment Rentals"],
      "activities": ["Swimming", "Snorkeling", "Diving", "Whale Watching", "Temple Visits", "Hot Springs", "Surfing"],
      "routes": []
    },
    {
      "id": "30",
      "name": "Ritigala Forest Monastery",
      "category": "landmark",
      "description": "Ancient forest monastery ruins in nature reserve",
      "longDescription": "Ritigala is an ancient Buddhist monastery complex dating to 1st century BC, nestled within a strict nature reserve on an isolated mountain. Mysterious ruins include elevated stone pathways, meditation platforms, bathing pools, and the unique 'double platform' structures. The monastery was home to austere ascetic monks (Pansukulikas) who followed strict practices. Dense forest creates an atmospheric setting with minimal restoration allowing nature to reclaim structures. The mountain's isolation and microclimate support unique flora and fauna. Ritigala's remote location and lack of crowds offer peaceful exploration of one of Sri Lanka's most enigmatic archaeological sites.",
      "image": "https://images.unsplash.com/photo-1605577461853-d771eae8e4da?w=800",
      "latitude": 8.1469,
      "longitude": 80.6981,
      "rating": 4.2,
      "popular": false,
      "entryFee": "LKR 500 for foreigners, LKR 100 for locals",
      "openingHours": "7:00 AM - 5:00 PM daily",
      "bestTimeToVisit": "December to April for dry weather, morning hours for wildlife and cooler temperatures",
      "facilities": ["Parking", "Restrooms", "Basic Trails", "Information Boards"],
      "activities": ["Archaeological Exploration", "Nature Walks", "Photography", "Bird Watching", "Meditation"],
      "routes": []
    },
    {
      "id": "31",
      "name": "Kalpitiya",
      "category": "adventure",
      "description": "Kitesurfing hub with dolphin watching",
      "longDescription": "Kalpitiya is Sri Lanka's premier kitesurfing destination with consistent winds from May to October creating perfect conditions for water sports enthusiasts. The shallow Kalpitiya Lagoon provides ideal learning conditions while advanced riders enjoy the open ocean. Beyond kitesurfing, Kalpitiya is famous for dolphin watching with resident spinner dolphins performing acrobatic displays. Bar Reef, Sri Lanka's largest coral reef, offers exceptional diving and snorkeling. The remote peninsula features pristine beaches, Portuguese-era Dutch Fort, and fishing village culture. Whale watching season (November-April) brings blue whales and sperm whales close to shore.",
      "image": "https://images.unsplash.com/photo-1502933691298-84fc14542831?w=800",
      "latitude": 8.2333,
      "longitude": 79.7667,
      "rating": 4.4,
      "popular": false,
      "entryFee": "Beach access free, kitesurfing lessons LKR 5,000-8,000, dolphin tours LKR 3,000-5,000",
      "openingHours": "Beach accessible 24/7, kitesurfing best 1:00 PM-5:00 PM when winds pick up",
      "bestTimeToVisit": "May to October for kitesurfing, November to April for whale watching",
      "facilities": ["Kite Schools", "Equipment Rentals", "Guesthouses", "Restaurants", "Dive Centers", "Boat Services"],
      "activities": ["Kitesurfing", "Dolphin Watching", "Whale Watching", "Diving", "Snorkeling", "Windsurfing", "Island Hopping"],
      "routes": []
    },
    {
      "id": "32",
      "name": "Matale Spice Gardens",
      "category": "landmark",
      "description": "Traditional spice plantations and Ayurvedic gardens",
      "longDescription": "Matale, located between Kandy and Dambulla, is famous for aromatic spice gardens showcasing Sri Lanka's spice trade heritage. Guided tours through lush gardens demonstrate cultivation of cinnamon, cardamom, pepper, vanilla, nutmeg, and cloves. Knowledgeable guides explain traditional uses for culinary, medicinal, and cosmetic purposes. Many gardens include Ayurvedic centers offering traditional treatments and massages using garden-grown herbs. Fresh spices and herbal products are available for purchase at reasonable prices. The sensory experience of fragrant plants combined with traditional knowledge makes these gardens educational and enjoyable stops along the cultural triangle route.",
      "image": "https://images.unsplash.com/photo-1598214917915-63a1f6e5b9ad?w=800",
      "latitude": 7.4675,
      "longitude": 80.6234,
      "rating": 4.0,
      "popular": false,
      "entryFee": "Free entry to most gardens (purchases encouraged), Ayurvedic treatments extra",
      "openingHours": "8:00 AM - 6:00 PM daily",
      "bestTimeToVisit": "Year-round, morning hours for cooler weather during garden walks",
      "facilities": ["Parking", "Restrooms", "Spice Shops", "Restaurants", "Ayurvedic Centers"],
      "activities": ["Garden Tours", "Spice Shopping", "Ayurvedic Treatments", "Cooking Demonstrations", "Educational Tours"],
      "routes": []
    },
    {
      "id": "33",
      "name": "Buduruwagala",
      "category": "religious",
      "description": "Ancient rock carving of seven Buddha figures",
      "longDescription": "Buduruwagala features seven colossal Buddha statues carved into a rock face dating to the 10th century. The central standing Buddha figure towers 16 meters high, making it one of Sri Lanka's tallest ancient Buddha statues. Flanked by six smaller figures representing Bodhisattvas and deities, the carvings show Mahayana Buddhist influences rare in predominantly Theravada Sri Lanka. Traces of ancient stucco and paint work remain visible. The remote jungle setting southeast of Ella creates a peaceful atmosphere. Unlike crowded tourist sites, Buduruwagala offers quiet contemplation and impressive ancient art in a serene natural environment.",
      "image": "https://images.unsplash.com/photo-1587427011046-2b87e0e2c750?w=800",
      "latitude": 6.7506,
      "longitude": 81.1450,
      "rating": 4.2,
      "popular": false,
      "entryFee": "LKR 500 for foreigners, free for locals",
      "openingHours": "7:00 AM - 6:00 PM daily",
      "bestTimeToVisit": "Early morning or late afternoon for best lighting and fewer visitors",
      "facilities": ["Parking", "Basic Restrooms", "Small Information Board", "Donation Box"],
      "activities": ["Archaeological Exploration", "Photography", "Religious Observance", "Historical Learning"],
      "routes": []
    },
    {
      "id": "34",
      "name": "Belihuloya",
      "category": "adventure",
      "description": "Hill country village for trekking and waterfalls",
      "longDescription": "Belihuloya is a tranquil hill country village surrounded by lush mountains, tea estates, and pristine streams perfect for nature lovers seeking off-the-beaten-path experiences. Multiple hiking trails lead to viewpoints, waterfalls, and natural pools. Samanalawewa Reservoir nearby offers scenic boat rides and water sports. Popular treks include ascents to Bambaragala Peak and Horton Plains alternative routes. The cool climate, misty mornings, and rural village life provide authentic Sri Lankan hill country experiences without tourist crowds. Comfortable guesthouses offer warm hospitality while adventure operators arrange treks, camping, and canyoning expeditions through spectacular landscapes.",
      "image": "https://images.unsplash.com/photo-1506905925346-21bda4d32df4?w=800",
      "latitude": 6.7089,
      "longitude": 80.7450,
      "rating": 4.3,
      "popular": false,
      "entryFee": "Village access free, some guided treks charge LKR 2,000-5,000",
      "openingHours": "Accessible 24/7, best hiking 6:00 AM - 4:00 PM",
      "bestTimeToVisit": "January to March for clear weather, avoid October-November monsoons",
      "facilities": ["Guesthouses", "Small Restaurants", "Adventure Tour Operators", "Basic Shops"],
      "activities": ["Trekking", "Waterfall Visits", "Camping", "Bird Watching", "Village Tours", "Tea Plantation Walks"],
      "routes": []
    }
  ],
  "routes": [
    {
      "id": "1",
      "name": "Colombo to Kandy",
      "from": "Colombo Fort",
      "to": "Kandy",
      "transportMode": "train",
      "duration": "3 hours",
      "distance": "115 km",
      "price": 180,
      "popular": true,
      "scenic": true
    },
    {
      "id": "2",
      "name": "Colombo to Galle",
      "from": "Colombo Fort",
      "to": "Galle",
      "transportMode": "train",
      "duration": "2.5 hours",
      "distance": "119 km",
      "price": 150,
      "popular": true,
      "scenic": true
    },
    {
      "id": "3",
      "name": "Kandy to Ella",
      "from": "Kandy",
      "to": "Ella",
      "transportMode": "train",
      "duration": "6 hours",
      "distance": "140 km",
      "price": 200,
      "popular": true,
      "scenic": true
    },
    {
      "id": "4",
      "name": "Colombo to Negombo",
      "from": "Colombo Central",
      "to": "Negombo",
      "transportMode": "bus",
      "duration": "1 hour",
      "distance": "37 km",
      "price": 80,
      "popular": true,
      "scenic": false
    },
    {
      "id": "5",
      "name": "Galle to Mirissa",
      "from": "Galle",
      "to": "Mirissa",
      "transportMode": "bus",
      "duration": "45 mins",
      "distance": "28 km",
      "price": 60,
      "popular": true,
      "scenic": false
    },
    {
      "id": "6",
      "name": "Colombo to Anuradhapura",
      "from": "Colombo Fort",
      "to": "Anuradhapura",
      "transportMode": "train",
      "duration": "4 hours",
      "distance": "205 km",
      "price": 220,
      "popular": true,
      "scenic": false
    },
    {
      "id": "7",
      "name": "Colombo to Jaffna",
      "from": "Colombo Fort",
      "to": "Jaffna",
      "transportMode": "train",
      "duration": "9 hours",
      "distance": "395 km",
      "price": 400,
      "popular": true,
      "scenic": false
    },
    {
      "id": "8",
      "name": "Kandy to Nuwara Eliya",
      "from": "Kandy",
      "to": "Nuwara Eliya",
      "transportMode": "bus",
      "duration": "2.5 hours",
      "distance": "77 km",
      "price": 120,
      "popular": true,
      "scenic": true
    },
    {
      "id": "9",
      "name": "Colombo to Ella",
      "from": "Colombo Fort",
      "to": "Ella",
      "transportMode": "train",
      "duration": "8 hours",
      "distance": "240 km",
      "price": 280,
      "popular": true,
      "scenic": true
    },
    {
      "id": "10",
      "name": "Colombo to Bentota",
      "from": "Colombo Central",
      "to": "Bentota",
      "transportMode": "bus",
      "duration": "1.5 hours",
      "distance": "62 km",
      "price": 100,
      "popular": true,
      "scenic": true
    },
    {
      "id": "11",
      "name": "Galle to Matara",
      "from": "Galle",
      "to": "Matara",
      "transportMode": "train",
      "duration": "1.5 hours",
      "distance": "44 km",
      "price": 90,
      "popular": true,
      "scenic": true
    },
    {
      "id": "12",
      "name": "Colombo to Trincomalee",
      "from": "Colombo Central",
      "to": "Trincomalee",
      "transportMode": "bus",
      "duration": "7 hours",
      "distance": "257 km",
      "price": 350,
      "popular": true,
      "scenic": false
    },
    {
      "id": "13",
      "name": "Ella to Arugam Bay",
      "from": "Ella",
      "to": "Arugam Bay",
      "transportMode": "bus",
      "duration": "3 hours",
      "distance": "97 km",
      "price": 150,
      "popular": true,
      "scenic": false
    },
    {
      "id": "14",
      "name": "Kandy to Sigiriya",
      "from": "Kandy",
      "to": "Sigiriya",
      "transportMode": "bus",
      "duration": "2 hours",
      "distance": "89 km",
      "price": 130,
      "popular": true,
      "scenic": false
    },
    {
      "id": "15",
      "name": "Nuwara Eliya to Ella",
      "from": "Nuwara Eliya",
      "to": "Ella",
      "transportMode": "train",
      "duration": "3 hours",
      "distance": "67 km",
      "price": 180,
      "popular": true,
      "scenic": true
    },
    {
      "id": "16",
      "name": "Colombo to Polonnaruwa",
      "from": "Colombo Central",
      "to": "Polonnaruwa",
      "transportMode": "bus",
      "duration": "5 hours",
      "distance": "228 km",
      "price": 300,
      "popular": true,
      "scenic": false
    },
    {
      "id": "17",
      "name": "Colombo to Kitulgala",
      "from": "Colombo Central",
      "to": "Kitulgala",
      "transportMode": "bus",
      "duration": "2.5 hours",
      "distance": "90 km",
      "price": 150,
      "popular": true,
      "scenic": true
    },
    {
      "id": "18",
      "name": "Matara to Bundala",
      "from": "Matara",
      "to": "Bundala",
      "transportMode": "bus",
      "duration": "2 hours",
      "distance": "85 km",
      "price": 140,
      "popular": false,
      "scenic": true
    }
  ],
  "busStops": [
    {
      "id": "1",
      "name": "Colombo Central Bus Stand",
      "code": "CBS",
      "latitude": 6.9271,
      "longitude": 79.8612,
      "city": "Colombo"
    },
    {
      "id": "2",
      "name": "Kandy Bus Terminal",
      "code": "KBT",
      "latitude": 7.2906,
      "longitude": 80.6337,
      "city": "Kandy"
    },
    {
      "id": "3",
      "name": "Galle Bus Stand",
      "code": "GBS",
      "latitude": 6.0535,
      "longitude": 80.2210,
      "city": "Galle"
    },
    {
      "id": "4",
      "name": "Negombo Bus Stand",
      "code": "NBS",
      "latitude": 7.2084,
      "longitude": 79.8358,
      "city": "Negombo"
    }
  ],
  "trainStations": [
    {
      "id": "1",
      "code": "CLB",
      "name": "Colombo Fort Railway Station",
      "latitude": 6.9344,
      "longitude": 79.8428,
      "city": "Colombo"
    },
    {
      "id": "2",
      "code": "KDY",
      "name": "Kandy Railway Station",
      "latitude": 7.2926,
      "longitude": 80.6355,
      "city": "Kandy"
    },
    {
      "id": "3",
      "code": "GLE",
      "name": "Galle Railway Station",
      "latitude": 6.0367,
      "longitude": 80.2170,
      "city": "Galle"
    },
    {
      "id": "4",
      "code": "ELA",
      "name": "Ella Railway Station",
      "latitude": 6.8667,
      "longitude": 81.0467,
      "city": "Ella"
    },
    {
      "id": "5",
      "code": "NWE",
      "name": "Nanu Oya Railway Station",
      "latitude": 6.9476,
      "longitude": 80.7606,
      "city": "Nuwara Eliya"
    }
  ],
  "schedules": [
    {
      "id": "1",
      "routeId": "1",
      "departureTime": "06:00",
      "arrivalTime": "09:00",
      "trainNumber": "1005",
      "trainName": "Intercity Express",
      "status": "on-time"
    },
    {
      "id": "2",
      "routeId": "1",
      "departureTime": "08:30",
      "arrivalTime": "11:45",
      "trainNumber": "1007",
      "trainName": "Express Train",
      "status": "on-time"
    },
    {
      "id": "3",
      "routeId": "2",
      "departureTime": "07:00",
      "arrivalTime": "09:30",
      "trainNumber": "8045",
      "trainName": "Southern Express",
      "status": "delayed"
    },
    {
      "id": "4",
      "routeId": "3",
      "departureTime": "08:45",
      "arrivalTime": "14:50",
      "trainNumber": "1005",
      "trainName": "Udarata Menike",
      "status": "on-time"
    },
    {
      "id": "5",
      "routeId": "4",
      "departureTime": "06:30",
      "arrivalTime": "07:30",
      "busNumber": "245",
      "busType": "AC",
      "status": "on-time"
    },
    {
      "id": "6",
      "routeId": "4",
      "departureTime": "07:45",
      "arrivalTime": "08:45",
      "busNumber": "245A",
      "busType": "Regular",
      "status": "on-time"
    }
  ]
}
